RDVMI.rdvmi-ext/src/Catalogs/рдв_СообщенияИнтеграции/рдв_СообщенияИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>рдв_СообщенияИнтеграции</name>
  <comment>VELO-640</comment>
  <attributes>
    <name>ДатаСообщения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Интерфейс</name>
    <type>
      <types>CatalogRef.рдв_ИнтерфейсыИнтеграции</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.рдв_НаправленияСообщенийИнтеграции</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСообщения</name>
    <type>
      <types>CatalogRef.рдв_ВидыСообщенийИнтеграции</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмерСообщения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтвета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмерОтвета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазовыйURL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтносительныйURL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодСостоянияОтвета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьМс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыURL</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаголовкиСообщения</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыСообщения</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаголовкиОтвета</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RDVMI.rdvmi-ext/src/InformationRegisters/рдв_ДанныеСообщенийИнтеграции/рдв_ДанныеСообщенийИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рдв_ДанныеСообщенийИнтеграции</name>
  <comment>VELO-609</comment>
  <resources>
    <name>ДанныеСообщения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ДанныеОтвета</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>СообщениеИнтеграции</name>
    <type>
      <types>CatalogRef.рдв_СообщенияИнтеграции</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RDVMI.rdvmi-ext/src/Catalogs/рдв_СообщенияИнтеграции/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЗаписьДанных = РегистрыСведений.рдв_ДанныеСообщенийИнтеграции.СоздатьМенеджерЗаписи();
	ЗаписьДанных.СообщениеИнтеграции = Объект.Ссылка;
	ЗаписьДанных.Прочитать();
	
	Если ЗаписьДанных.Выбран() Тогда
		ДанныеЗапроса = ЗаписьДанных.ДанныеСообщения.Получить();
		ДанныеОтвета = ЗаписьДанных.ДанныеОтвета.Получить();
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура СтруктурироватьДанные(Команда)
	СтруктурироватьДанныеНаСервере();
КонецПроцедуры

&НаСервере
Процедура СтруктурироватьДанныеНаСервере()
	ДанныеЗапроса = рдв_РаботаССервисами.СтруктурироватьТекстJSON(ДанныеЗапроса);
	ДанныеОтвета = рдв_РаботаССервисами.СтруктурироватьТекстJSON(ДанныеОтвета);
КонецПроцедуры
